Titanic Prediction

In [14]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler, LabelEncoder
import pickle

In [15]:
titanic_dataset = pd.read_csv('titanic.csv')
titanic_dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,NaN,S

In [16]:
titanic_dataset.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
titanic_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1310 non-null   object
 1   Survived     1310 non-null   object
 2   Pclass       1310 non-null   object
 3   Name         1310 non-null   object
 4   Sex          1224 non-null   object
 5   Age          1133 non-null   object
 6   SibSp        1310 non-null   object
 7   Parch        1310 non-null   object
 8   Ticket       1309 non-null   object
 9   Fare         983 non-null    object
 10  Cabin        623 non-null    object
 11  Embarked     889 non-null    object
dtypes: object(12)
memory usage: 122.9+ KB

In [18]:
titanic_dataset.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex             86
Age            177
SibSp            0
Parch            0
Ticket           1
Fare           327
Cabin          687
Embarked       421
dtype: int64

In [19]:
titanic_dataset.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex             86
Age            177
SibSp            0
Parch            0
Ticket           1
Fare           327
Cabin          687
Embarked       421
dtype: int64

In [20]:
print(titanic_dataset['Sex'].describe())

count     1224
unique      82
top       male
freq       577
Name: Sex, dtype: object

In [21]:
titanic_dataset['Sex'].mode()

0    male
Name: Sex, dtype: object

In [22]:
titanic_dataset['Sex'].fillna(titanic_dataset['Sex'].mode()[0], inplace=True)

C:\Users\krith\AppData\Local\Temp\ipykernel_24288\2142414920.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_dataset['Sex'].fillna(titanic_dataset['Sex'].mode()[0], inplace=True)

In [23]:
titanic_dataset.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           1
Fare           327
Cabin          687
Embarked       421
dtype: int64

In [24]:
type(titanic_dataset['Age'])

pandas.core.series.Series

In [25]:
titanic_dataset["Age"] = pd.to_numeric(titanic_dataset["Age"], errors="coerce")

titanic_dataset['Age'].fillna(titanic_dataset['Age'].mean(), inplace=True)

C:\Users\krith\AppData\Local\Temp\ipykernel_24288\4265812230.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_dataset['Age'].fillna(titanic_dataset['Age'].mean(), inplace=True)

In [28]:
titanic_dataset.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           1
Fare           327
Cabin          687
Embarked       421
dtype: int64

In [31]:
titanic_dataset['Fare'].fillna(0, inplace=True)

In [33]:
titanic_dataset['Ticket'].fillna('0', inplace=True)

C:\Users\krith\AppData\Local\Temp\ipykernel_24288\856108340.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_dataset['Ticket'].fillna('0', inplace=True)

In [34]:
titanic_dataset['Cabin'].fillna('0', inplace=True)

C:\Users\krith\AppData\Local\Temp\ipykernel_24288\1886411505.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_dataset['Cabin'].fillna('0', inplace=True)

In [35]:
titanic_dataset["Embarked"].fillna(titanic_dataset["Embarked"].mode()[0], inplace=True)

C:\Users\krith\AppData\Local\Temp\ipykernel_24288\3869615947.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_dataset["Embarked"].fillna(titanic_dataset["Embarked"].mode()[0], inplace=True)

In [36]:
titanic_dataset.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [37]:
titanic_dataset = titanic_dataset.drop(['PassengerId','Name','Ticket','Cabin'], axis=1)

In [ ]:
titanic_dataset

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,male,22.0,1,0,7.25,S
1,1,1,female,38.0,1,0,71.2833,C
2,1,3,female,26.0,0,0,7.925,S
3,1,1,female,35.0,1,0,53.1,S
4,0,3,male,35.0,0,0,8.05,S
...,...,...,...,...,...,...,...,...
1305,3,"Spector, Mr. Woolf",male,0.0,0,A.5. 3236,0,S
1306,1,"Oliva y Ocana, Dona. Fermina",39,0.0,0,PC 17758,C105,S
1307,3,"Saether, Mr. Simon Sivertsen",38.5,0.0,0,SOTON/O.Q. 3101262,0,S
1308,3,"Ware, Mr. Frederick",male,0.0,0,359309,0,S
1309,3,"Peter, Master. Michael J",male,1.0,1,2668,0,S

: